# Taller de manejo de DataFrame con Concatenación
## Estudiantes:
- Andrés Mauricio Acosta Pulido 
    - 20142020111
- Leidy Marcela Aldana Burgos 
    - 20151020019

# Ejemplo 1

In [45]:
import pandas as pd

In [46]:
dfnomina = pd.DataFrame({'SueldoParcial': ['5.000.000', '4.200.000', '12.000.000', '2.250.000','1.500.000'],'SueldoTotal': ['4.800.000', '4.000.000', '11.800.000', '2.050.000','1.200.000']},index=[0, 1, 2, 3, 4])
dfnomina

  SueldoParcial SueldoTotal
0     5.000.000   4.800.000
1     4.200.000   4.000.000
2    12.000.000  11.800.000
3     2.250.000   2.050.000
4     1.500.000   1.200.000

In [47]:
dfempleado = pd.DataFrame({'primerNombre': ['Andres', 'Leidy', 'Marcela', 'Mauricio','Teresa'],'SegundoNombre': ['Acosta', 'Pulido', 'Cuitiva', 'Aldana','Moreno'], 'Cedula': ['123','456','678','901','142'],'profesión':['Ingeniero','Administrador','Enfermera','Medica','Topografo']},index=[0, 1, 2, 3, 4])
dfempleado

  primerNombre SegundoNombre Cedula      profesión
0       Andres        Acosta    123      Ingeniero
1        Leidy        Pulido    456  Administrador
2      Marcela       Cuitiva    678      Enfermera
3     Mauricio        Aldana    901         Medica
4       Teresa        Moreno    142      Topografo

In [48]:
aux=[dfnomina,dfempleado]
#SueldoEmpleado

In [49]:
dfv=pd.concat(aux, axis=1, join_axes=[dfempleado.index])
frames1=[dfv['primerNombre'],dfv['SegundoNombre'],dfv["profesión"],dfv["SueldoTotal"]]
sueldoEmpleado=pd.concat(frames1, axis=1)
sueldoEmpleado[(sueldoEmpleado['SueldoTotal'] >= '3.000.000')]

  primerNombre SegundoNombre      profesión SueldoTotal
0       Andres        Acosta      Ingeniero   4.800.000
1        Leidy        Pulido  Administrador   4.000.000

# Ejemplo 2

In [50]:
dfalgoritmo = pd.DataFrame({'Algoritmo Genetico': ['al1', 'al2', 'al3', 'al4'],'Area_Aplicacion': ['Psiquiatria', 'Criptografia', 'Sociología', ' ']},index=[0, 1, 2, 3])
dfmutacion = pd.DataFrame({'Mutacion': ['m1', 'm2', 'm3', 'm4'], 'Descripción':['dm1', 'dm2', 'dm3', ' ']},index=[0, 1, 2, 3])

dfmutacion

  Mutacion Descripción
0       m1         dm1
1       m2         dm2
2       m3         dm3
3       m4

In [51]:
frames = [dfalgoritmo, dfmutacion]
dfTotal = pd.concat(frames, axis=1)
dfTotal
framesAux=[dfTotal['Area_Aplicacion'],dfTotal['Mutacion']]
frame=pd.concat(framesAux, axis=1)
frame.where(frame['Area_Aplicacion'] != ' ')

  Area_Aplicacion Mutacion
0     Psiquiatria       m1
1    Criptografia       m2
2      Sociología       m3
3             NaN      NaN

# Ejemplo 3

In [58]:
dfnomina = pd.DataFrame({'SueldoParcial': [5000000, 4200000, 12000000, 2250000,1500000],'SueldoTotal': [4800000, 4000000, 11800000, 2050000,1200000]},index=[0, 1, 2, 3, 4])
# Se calcula el valor del interes entre el mismo dataframe, para poder concatenarlo, el valor es un porcentaje
valorInteres=pd.DataFrame({'interes':dfnomina.eval('100-(SueldoTotal*100/SueldoParcial)')})
dfinteres=pd.concat([valorInteres,dfnomina], axis=1)
dfinteres

     interes  SueldoParcial  SueldoTotal
0   4.000000        5000000      4800000
1   4.761905        4200000      4000000
2   1.666667       12000000     11800000
3   8.888889        2250000      2050000
4  20.000000        1500000      1200000